### Pyspark Handling Missing Values
- Dropping Columns
- Dropping Rows
- Various Parameter In Dropping Functionalitites
- Handling Missing Values by Mean, Median and Mode

In [4]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [9]:
df_pyspark=spark.read.csv('DATA/test3.csv', header=True, inferSchema=True)

In [10]:
df_pyspark.show()

+-------+----+----------+------+
|   name| age|expereince|salary|
+-------+----+----------+------+
| Ashley|  49|        12|167579|
|Jessica|null|      null|286375|
|Michael|  70|         6|294100|
| Ashley|  18|        13|155420|
|   null|  58|         1|228810|
|  Jacob|  24|        10|  null|
|  Emily|  49|         5|272015|
|  David|  63|         4|178549|
|Jessica|  41|        12|162692|
|   null|  58|      null|  null|
|   John|  31|        22|166813|
|  David|  77|        19|203596|
|Jessica|  73|         3|176848|
|  David|  53|        15|283763|
|  Emily|  64|        23|106789|
|   John|  70|        18|150195|
|Michael|  64|        21|185957|
|Matthew|  24|         8|168989|
| Ashley|  19|         8|272867|
|  Emily|  27|        17|249753|
+-------+----+----------+------+
only showing top 20 rows

In [12]:
### Drop Columns
df_pyspark.drop('name').show()

+----+----------+------+
| age|expereince|salary|
+----+----------+------+
|  49|        12|167579|
|null|      null|286375|
|  70|         6|294100|
|  18|        13|155420|
|  58|         1|228810|
|  24|        10|  null|
|  49|         5|272015|
|  63|         4|178549|
|  41|        12|162692|
|  58|      null|  null|
|  31|        22|166813|
|  77|        19|203596|
|  73|         3|176848|
|  53|        15|283763|
|  64|        23|106789|
|  70|        18|150195|
|  64|        21|185957|
|  24|         8|168989|
|  19|         8|272867|
|  27|        17|249753|
+----+----------+------+
only showing top 20 rows

In [13]:
### Drop Null Values
df_pyspark.na.drop().show()

+-------+---+----------+------+
|   name|age|expereince|salary|
+-------+---+----------+------+
| Ashley| 49|        12|167579|
|Michael| 70|         6|294100|
| Ashley| 18|        13|155420|
|  Emily| 49|         5|272015|
|  David| 63|         4|178549|
|Jessica| 41|        12|162692|
|   John| 31|        22|166813|
|  David| 77|        19|203596|
|Jessica| 73|         3|176848|
|  David| 53|        15|283763|
|  Emily| 64|        23|106789|
|   John| 70|        18|150195|
|Michael| 64|        21|185957|
|Matthew| 24|         8|168989|
| Ashley| 19|         8|272867|
|  Emily| 27|        17|249753|
|   John| 35|        19|108132|
|  Sarah| 34|        18|276988|
|Michael| 72|        14|100630|
|  David| 37|        19|138654|
+-------+---+----------+------+
only showing top 20 rows

In [15]:
## any==how
# by default it is any
df_pyspark.na.drop(how='any').show()

+-------+---+----------+------+
|   name|age|expereince|salary|
+-------+---+----------+------+
| Ashley| 49|        12|167579|
|Michael| 70|         6|294100|
| Ashley| 18|        13|155420|
|  Emily| 49|         5|272015|
|  David| 63|         4|178549|
|Jessica| 41|        12|162692|
|   John| 31|        22|166813|
|  David| 77|        19|203596|
|Jessica| 73|         3|176848|
|  David| 53|        15|283763|
|  Emily| 64|        23|106789|
|   John| 70|        18|150195|
|Michael| 64|        21|185957|
|Matthew| 24|         8|168989|
| Ashley| 19|         8|272867|
|  Emily| 27|        17|249753|
|   John| 35|        19|108132|
|  Sarah| 34|        18|276988|
|Michael| 72|        14|100630|
|  David| 37|        19|138654|
+-------+---+----------+------+
only showing top 20 rows

In [18]:
## threshold
# at least 2 non null values should be present.
df_pyspark.na.drop(how='any', thresh=2).show()

+-------+----+----------+------+
|   name| age|expereince|salary|
+-------+----+----------+------+
| Ashley|  49|        12|167579|
|Jessica|null|      null|286375|
|Michael|  70|         6|294100|
| Ashley|  18|        13|155420|
|   null|  58|         1|228810|
|  Jacob|  24|        10|  null|
|  Emily|  49|         5|272015|
|  David|  63|         4|178549|
|Jessica|  41|        12|162692|
|   John|  31|        22|166813|
|  David|  77|        19|203596|
|Jessica|  73|         3|176848|
|  David|  53|        15|283763|
|  Emily|  64|        23|106789|
|   John|  70|        18|150195|
|Michael|  64|        21|185957|
|Matthew|  24|         8|168989|
| Ashley|  19|         8|272867|
|  Emily|  27|        17|249753|
|   John|  35|        19|108132|
+-------+----+----------+------+
only showing top 20 rows

In [21]:
## subset
# only focusing on a specific column
df_pyspark.na.drop(how='any', subset=['age']).show()

+-------+---+----------+------+
|   name|age|expereince|salary|
+-------+---+----------+------+
| Ashley| 49|        12|167579|
|Michael| 70|         6|294100|
| Ashley| 18|        13|155420|
|   null| 58|         1|228810|
|  Jacob| 24|        10|  null|
|  Emily| 49|         5|272015|
|  David| 63|         4|178549|
|Jessica| 41|        12|162692|
|   null| 58|      null|  null|
|   John| 31|        22|166813|
|  David| 77|        19|203596|
|Jessica| 73|         3|176848|
|  David| 53|        15|283763|
|  Emily| 64|        23|106789|
|   John| 70|        18|150195|
|Michael| 64|        21|185957|
|Matthew| 24|         8|168989|
| Ashley| 19|         8|272867|
|  Emily| 27|        17|249753|
|   John| 35|        19|108132|
+-------+---+----------+------+
only showing top 20 rows

In [28]:
### Fill the missing values
## Since a recent update you cannot replace all type columns with a single value so you will have to split e.g
# https://sparkbyexamples.com/pyspark/pyspark-fillna-fill-replace-null-values/
# Int values only (becuase i'm replace with a int value so all int values will be changed)
df_pyspark.na.fill(value=0).show()

+-------+---+----------+------+
|   name|age|expereince|salary|
+-------+---+----------+------+
| Ashley| 49|        12|167579|
|Jessica|  0|         0|286375|
|Michael| 70|         6|294100|
| Ashley| 18|        13|155420|
|   null| 58|         1|228810|
|  Jacob| 24|        10|     0|
|  Emily| 49|         5|272015|
|  David| 63|         4|178549|
|Jessica| 41|        12|162692|
|   null| 58|         0|     0|
|   John| 31|        22|166813|
|  David| 77|        19|203596|
|Jessica| 73|         3|176848|
|  David| 53|        15|283763|
|  Emily| 64|        23|106789|
|   John| 70|        18|150195|
|Michael| 64|        21|185957|
|Matthew| 24|         8|168989|
| Ashley| 19|         8|272867|
|  Emily| 27|        17|249753|
+-------+---+----------+------+
only showing top 20 rows

In [29]:
# Str values only (becuase i'm replace with a str value so all int values will be changed)
df_pyspark.na.fill(value='Missing Data').show()

+------------+----+----------+------+
|        name| age|expereince|salary|
+------------+----+----------+------+
|      Ashley|  49|        12|167579|
|     Jessica|null|      null|286375|
|     Michael|  70|         6|294100|
|      Ashley|  18|        13|155420|
|Missing Data|  58|         1|228810|
|       Jacob|  24|        10|  null|
|       Emily|  49|         5|272015|
|       David|  63|         4|178549|
|     Jessica|  41|        12|162692|
|Missing Data|  58|      null|  null|
|        John|  31|        22|166813|
|       David|  77|        19|203596|
|     Jessica|  73|         3|176848|
|       David|  53|        15|283763|
|       Emily|  64|        23|106789|
|        John|  70|        18|150195|
|     Michael|  64|        21|185957|
|     Matthew|  24|         8|168989|
|      Ashley|  19|         8|272867|
|       Emily|  27|        17|249753|
+------------+----+----------+------+
only showing top 20 rows

In [32]:
### Filling missing data with aggregates of columns 
from pyspark.ml.feature import Imputer

imputer = Imputer(inputCols=['age', 'expereince', 'salary'],
                 outputCols=["{}_imputed".format(c) for c in ['age', 'expereince', 'salary']]).setStrategy("mean")

In [33]:
# Add imputation cols to df 
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   name| age|expereince|salary|age_imputed|expereince_imputed|salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
| Ashley|  49|        12|167579|         49|                12|        167579|
|Jessica|null|      null|286375|         49|                13|        286375|
|Michael|  70|         6|294100|         70|                 6|        294100|
| Ashley|  18|        13|155420|         18|                13|        155420|
|   null|  58|         1|228810|         58|                 1|        228810|
|  Jacob|  24|        10|  null|         24|                10|        187627|
|  Emily|  49|         5|272015|         49|                 5|        272015|
|  David|  63|         4|178549|         63|                 4|        178549|
|Jessica|  41|        12|162692|         41|                12|        162692|
|   null|  58|      null|  null|         58|                13|        187627|
|   John|  31|        22|166813|         31|                22|        166813|
|  David|  77|        19|203596|         77|                19|        203596|
|Jessica|  73|         3|176848|         73|                 3|        176848|
|  David|  53|        15|283763|         53|                15|        283763|
|  Emily|  64|        23|106789|         64|                23|        106789|
|   John|  70|        18|150195|         70|                18|        150195|
|Michael|  64|        21|185957|         64|                21|        185957|
|Matthew|  24|         8|168989|         24|                 8|        168989|
| Ashley|  19|         8|272867|         19|                 8|        272867|
|  Emily|  27|        17|249753|         27|                17|        249753|
+-------+----+----------+------+-----------+------------------+--------------+
only showing top 20 rows